# Задача 2: Найдите сумму цифр трехзначного числа.

# *Пример:*

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |

print('Ввести 3-х значное число')
a = int(input())
b = a % 10
a1 = a // 10
c = a1 % 10
d = a1 // 10
print( b + c + d,'(', d, '+', c, '+', b, ')')
